In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt 
X = np.arange(1, 10, .05).reshape(-1, 1)
y = np.array([x + np.random.normal(0, x / 5) for x in X]).reshape(-1, 1)

fig,ax=plt.subplots()
ax.scatter(X,y,c='r') #puntitos s=tamaño puntos c='r' color rojo #le podemos pasar un array 
plt.show()

class Regression():
    def __init__(self,X,y):
        self.X=X
        self.y=y
        return None
    
    def fit(self):        
        #fit by minimal squared method
        self.beta1=np.sum((self.X-np.mean(self.X))*(self.y-np.mean(self.y)))/np.sum((self.X-np.mean(self.X))**2)        
        self.beta0=(self.beta1*np.mean(self.X))-np.mean(self.y)
        #print(self.beta1,self.beta0)
        return None
    
    def predict(self,X):        
        return (X*self.beta1)+self.beta0

model=Regression(X,y)    
model.fit()
y_pred=model.predict(X)

fig,ax=plt.subplots()
ax.scatter(X,y,s=10,c='r') #puntitos s=tamaño puntos c='r' color rojo #le podemos pasar un array 
ax.plot(X,y_pred)
plt.show()

In [2]:
#Agregar datos en pandas

In [3]:
df = pd.DataFrame({'key1' : ['a','a','b','b','a'],
                   'key2' : ['one','two','one','two','one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one -0.387137 -0.266123
1    a  two -0.773443  0.644931
2    b  one  0.952665 -0.318987
3    b  two  0.745525 -1.152540
4    a  one  1.004091 -1.944727

In [5]:
df.groupby(["key1"]).mean()

         data1     data2
key1
a    -0.052163 -0.521973
b     0.849095 -0.735764

In [6]:
df.groupby(["key1","key2"]).mean()

              data1     data2
key1 key2
a    one   0.308477 -1.105425
     two  -0.773443  0.644931
b    one   0.952665 -0.318987
     two   0.745525 -1.152540

In [7]:
data_grouped=df.groupby("key1")

In [8]:
def range_min_max(a):
    return a.max()-a.min()


data_grouped.agg(range_min_max)

         data1     data2
key1
a     1.777534  2.589659
b     0.207140  0.833553

In [9]:
##TimeSeries

In [27]:
from datetime import datetime
from datetime import timedelta

In [38]:
start=datetime.now()
print(start)
print(start+timedelta(12))

2019-01-11 18:52:21.893522
2019-01-23 18:52:21.893522

In [36]:
import dateutil

In [37]:
dateutil.parser.parse('2019-01-11')

datetime.datetime(2019, 1, 11, 0, 0)

In [43]:
dates=[datetime(2011,1,2),datetime(2011,1,5),
       datetime(2011,1,7),datetime(2011,1,8),
       datetime(2011,1,10),datetime(2011,1,12)]

ts=pd.Series(np.random.randn(6),index=dates)
ts

2011-01-02   -1.076020
2011-01-05   -0.314936
2011-01-07    0.255912
2011-01-08   -0.264273
2011-01-10    0.432414
2011-01-12   -0.625183
dtype: float64

In [44]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [45]:
ts[::2]

2011-01-02   -1.076020
2011-01-07    0.255912
2011-01-10    0.432414
dtype: float64

In [46]:
ts

2011-01-02   -2.152040
2011-01-05         NaN
2011-01-07    0.511824
2011-01-08         NaN
2011-01-10    0.864827
2011-01-12         NaN
dtype: float64

In [47]:
ventas=[1,2,3,4,5,2,23,234,4,4]
pd.date_range('2019-1-1',periods=len(ventas))

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10'],
              dtype='datetime64[ns]', freq='D')

In [51]:
ts_ventas=pd.Series(ventas,index=pd.date_range('2019.1.1',periods=len(ventas)))

In [52]:
ts_ventas['2019-1-1':'2019-1-10'].mean()

28.2

In [53]:
ts_ventas.index[0].weekday()

1

In [54]:
df_ventas=pd.DataFrame({'ventas':ts_ventas})

In [55]:
df_ventas

            ventas
2019-01-01       1
2019-01-02       2
2019-01-03       3
2019-01-04       4
2019-01-05       5
2019-01-06       2
2019-01-07      23
2019-01-08     234
2019-01-09       4
2019-01-10       4

In [58]:
df_ventas['workday']=df_ventas.index.weekday<5

In [59]:
df_ventas

            ventas  workday
2019-01-01       1     True
2019-01-02       2     True
2019-01-03       3     True
2019-01-04       4     True
2019-01-05       5    False
2019-01-06       2    False
2019-01-07      23     True
2019-01-08     234     True
2019-01-09       4     True
2019-01-10       4     True

In [62]:
df_ventas.resample('2d').sum()

            ventas  workday
2019-01-01       3      2.0
2019-01-03       7      2.0
2019-01-05       7      0.0
2019-01-07     257      2.0
2019-01-09       8      2.0